music_app/app/views/albums/_album_form.html.erb

SELECT "bands".* FROM "bands"
---
		 >--PLEASE SELECT--</option>
		<% Band.all.each do |band| %>