music_app/app/controllers/albums_controller.rb

	def create
		@album = Album.new(album_params)
		if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 2], ["title", "ALBUM ONE"], ["year", 1234], ["live", true], ["created_at", "2019-10-10 00:28:52.331401"], ["updated_at", "2019-10-10 00:28:52.331401"]]

	def update
		@album = Album.find_by(id: params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]