music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "THE FURY2"], ["updated_at", "2019-10-09 22:02:19.470047"], ["id", 2]]
---
	def update
		@band = Band.find_by(id: params[:id])
		if @band
			if @band.update_attributes(band_params)

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
	def destroy
		@band = Band.find_by(id: params[:id])
		if @band
			@band.destroy