music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("track_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@note = Note.new(note_params)
		@note.user_id = current_user.id
		@note.save

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
	def destroy
		@note = current_user.notes.find_by(id: params[:id])
		if @note
			@note.destroy