music_app/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 1], ["title", "THIS IS A TITLE"], ["ord", 7], ["lyrics", "ASDFASDFASDF"], ["bonus", true], ["created_at", "2019-10-10 06:33:08.011219"], ["updated_at", "2019-10-10 06:33:08.011219"]]
---
	def create
		@track = Track.new(track_params)
		if @track.save

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "bonus" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["lyrics", "BLAH BLAH BLAH ASDF"], ["bonus", true], ["updated_at", "2019-10-10 04:05:00.130902"], ["id", 1]]
---
	def update
		@track = Track.find_by(id: params[:id])
		if @track
			if @track.update_attributes(track_params)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
	def destroy
		@track = Track.find_by(id: params[:id])
		if @track
			@track.destroy