music_app/app/views/tracks/_track_form.html.erb

		>--PLEASE SELECT--</option>
		<% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"