music_app/app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
Lyrics: <%= ugly_lyrics(@track.lyrics) %>
Notes: <% @track.notes.includes(:user).each do |note| %>